app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "trip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Watch out for Touareg separatists!"], ["user_id", 1], ["trip_id", 3], ["created_at", "2017-07-21 12:37:31.119426"], ["updated_at", "2017-07-21 12:37:31.119426"]]