app/controllers/legs_controller.rb

SELECT "legs".* FROM "legs"
---
  def index
    @legs = Leg.all

INSERT INTO "legs" ("name", "lat", "lng", "trip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Bamako"], ["lat", 32.1223], ["lng", 23.2324], ["trip_id", 3], ["created_at", "2017-07-21 12:38:24.760262"], ["updated_at", "2017-07-21 12:38:24.760262"]]
---
  def create
    @leg = Leg.new(leg_params)

    if @leg.save

DELETE FROM "legs" WHERE "legs"."id" = $1  [["id", 17]]
---
  def destroy
    @leg.destroy

SELECT  "legs".* FROM "legs" WHERE "legs"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
    def set_leg
      @leg = Leg.find(params[:id])