app/controllers/oauth_controller.rb

  def facebook
    token = HTTParty.post("https://graph.facebook.com/v2.9/oauth/access_token", {
    query: {
      client_id: ENV["FACEBOOK_APP_ID"],
      client_secret: ENV["FACEBOOK_APP_SECRET"],
      redirect_uri: 'https://adventurefy.herokuapp.com/',
      code: params[:code]
    },
    headers: { "Accept" => 'application/json' }
  }).parsed_response

  profile = HTTParty.get("https://graph.facebook.com/v2.5/me?fields=id,name,email,picture.height(300)", {
    query: token,
    headers: { "User-Agent"  => "HTTParty", "Accept" => "application/json" }
    }).parsed_response

    p "**************PROFILE: #{profile} TOKEN: #{token}"

      user = User.where("facebook_id = :facebook_id OR email = :email", facebook_id: profile["id"], email: profile["email"]).first

    user = User.new(username: profile["name"], email: profile["email"]) unless user

    user.facebook_id = profile["id"]
    user.email = profile["email"]
    user.remote_image_url = profile["picture"]["data"]["url"]

    if user.save
---
SELECT  "users".* FROM "users" WHERE (facebook_id = 'id' OR email = NULL) ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("created_at", "updated_at", "facebook_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2017-07-24 08:32:51.565081"], ["updated_at", "2017-07-24 08:32:51.565081"], ["facebook_id", "id"]]