app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
  def index
    @trips = Trip.all

INSERT INTO "trips" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 3], ["created_at", "2017-07-23 11:17:44.538827"], ["updated_at", "2017-07-23 11:17:44.538827"]]
---
  def create
    @trip = Trip.new(Uploader.upload(trip_params))
    @trip.user = current_user
    if @trip.save

UPDATE "trips" SET "user_id" = $1, "info" = $2, "updated_at" = $3 WHERE "trips"."id" = $4  [["user_id", 2], ["info", "Super fat tour of the Balkans"], ["updated_at", "2017-07-21 17:22:26.507463"], ["id", 1]]
---
  def update
    return render json: { errors: ["Unauthorized"] }, status: 401 if @trip.user != current_user
    if @trip.update(Uploader.upload(trip_params))

DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 5]]
---
  def destroy
    return render json: { errors: ["Unauthorized"] }, status: 401 if @trip.user != current_user
    @trip.destroy

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_trip
      @trip = Trip.find(params[:id])