app/controllers/users_controller.rb

  def create
    @user = User.new(Uploader.upload(user_params))

    if @user.save
---
INSERT INTO "users" ("username", "firstname", "lastname", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "WheresNimeshGone"], ["firstname", "Nimesh"], ["lastname", "Patel"], ["created_at", "2017-07-21 15:01:17.915646"], ["updated_at", "2017-07-21 15:01:17.915646"]]